; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 757172 1 3 4 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	image1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Planet5 spectrograph0)
	(have_image Star6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
	(have_image Planet10 thermograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
3. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
6. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 1 of 6
7. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
8. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 6
9. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 6
10. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 3 of 6
11. (turn_to satellite0 planet5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet5)
   goals met: 3 of 6
12. (take_image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 4 of 6
13. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 4 of 6
14. (take_image satellite0 planet10 instrument0 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 6
16. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 6 of 6
